cw09/cw9.org
#+title: Laboratorium 9 - Przetwarzanie asynchroniczne (wstęp do Node.js)
#+date: 09.12.2024r.
#+author: Piotr Karamon
#+setupfile: ../setupfile.org
#+latex_header: \usepackage{svg}
#+latex_header: \usepackage[a4paper, total={6.5in, 10in}]{geometry}


* Treści zadań
** Zadanie 1
+ 1a: Zaimplementuj funkcję loop, wg instrukcji w pliku z Rozwiązaniem 3.
+ 1b: wykorzystaj funkcję waterfall biblioteki async.
** Zadanie 2
Proszę napisać program obliczający liczbę linii we wszystkich plikach tekstowych
z danego drzewa katalogów. Do testów proszę wykorzystać zbiór danych Traceroute
Data. Program powinien wypisywać liczbę linii w każdym pliku, a na końcu ich
globalną sumę. Proszę zmierzyć czas wykonania dwóch wersji programu: z
synchronicznym (jeden po drugim) przetwarzaniem plików, z asynchronicznym
(jednoczesnym) przetwarzaniem plików.
Przydatne moduły:
+ =walkdir= -- trawersacja drzewa katalogów
+ =fs= -- operacje na systemie plików (moduł wbudowany)

Do obliczania liczby linii w pliku tekstowym proszę wykorzystać następujący fragment kodu:
#+begin_src js
fs.createReadStream(file).on('data', function(chunk) {
                count += chunk.toString('utf8')
                .split(/\r\n|[\n\r\u0085\u2028\u2029]/g)
                .length-1;
            }).on('end', function() {
                console.log(file, count);
            }).on('error', function(err) {
                console.error(err);
            });
#+end_src

* Zadanie 1
Mamy daną sekwencję operacji:
#+begin_src js
function printAsync(s, cb) {
  var delay = Math.floor(Math.random() * 1000 + 500);
  setTimeout(function () {
    console.log(s);
    if (cb) cb();
  }, delay);
}

function task(n) {
  return new Promise((resolve, reject) => {
    printAsync(n, function () {
      resolve(n);
    });
  });
}

task(1)
  .then((n) => {
    console.log("task", n, "done");
    return task(2);
  })
  .then((n) => {
    console.log("task", n, "done");
    return task(3);
  })
  .then((n) => {
    console.log("task", n, "done");
    console.log("done");
  });
#+end_src

