cw09/cw9.tex
\subsection*{Funkcja \texttt{loop(m)}}
\label{sec:org07079a3}
Wykorzystamy fakt, że taki ciąg operacji zwraca \texttt{Promise}, a zatem możemy
wywołać na nim funkcję \texttt{then} w pętli \texttt{for}, by ''doklejać'' kolejne zadania.

Tworzymy funkcję \texttt{task123}.
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{function} \EFf{task123}() \{
  \EFk{return} task(\EFhn{1})
    .then((n) => \{
      console.log(\EFs{"task"}, n, \EFs{"done"});
      \EFk{return} task(\EFhn{2});
    \})
    .then((n) => \{
      console.log(\EFs{"task"}, n, \EFs{"done"});
      \EFk{return} task(\EFhn{3});
    \})
    .then((n) => \{
      console.log(\EFs{"task"}, n, \EFs{"done"});
      console.log(\EFs{"done"});
    \});
\}
\end{Verbatim}
\end{Code}

Funkcja \texttt{loop}:
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{function} \EFf{loop}(\EFv{m}) \{
  \EFk{let} \EFv{promise} = task123();
  \EFk{for} (i = \EFhn{1}; i < m; i++) \{
    promise = promise.then(task123);
  \}
  \EFk{return} promise;
\}

loop(\EFhn{4});
\end{Verbatim}
\end{Code}

Wynik programu(pierwotny ciąg operacji został wykomentowany):
\begin{tcolorbox}
\begin{Verbatim}
1
task 1 done
2
task 2 done
3
task 3 done
done
1
task 1 done
2
task 2 done
3
task 3 done
done
1
task 1 done
2
task 2 done
3
task 3 done
done
1
task 1 done
2
task 2 done
3
task 3 done
done
\end{Verbatim}


\end{tcolorbox}
\subsection*{Funkcja \texttt{loopWithWaterfall(m)}}
\label{sec:org35fde45}
Do rozwiązania naszego problemu możemy użyć funkcji \texttt{waterfall} z biblioteki \texttt{async}.
Jak sama nazwa wskazuje, funkcja ta bierze ciąg
asynchronicznych funkcji i wywołuje je w kolejności, przekazując wynik jednej do drugiej.
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{const} \{ waterfall \} = require(\EFs{"async"});
\EFk{function} \EFf{loopWithWaterfall}(\EFv{m}) \{
  \EFk{const} \EFv{tasks} = Array.from(\{ length: m \}, () => \EFk{async} () => task123());
  waterfall(tasks);
\}

loopWithWaterfall(\EFhn{4});
\end{Verbatim}
\end{Code}

Wynik programu nie uległ zmianie:
\begin{tcolorbox}
\begin{Verbatim}
1
task 1 done
2
task 2 done
3
task 3 done
done
1
task 1 done
2
task 2 done
3
task 3 done
done
1
task 1 done
2
task 2 done
3
task 3 done
done
1
task 1 done
2
task 2 done
3
task 3 done
done
\end{Verbatim}


\end{tcolorbox}
\subsection*{Wnioski}
\label{sec:org96986cf}
\begin{itemize}
\item W obu funkcjach udało się uzyskać efekt sekwencyjnego wykonania.
\item Dzięki wykorzystaniu funkcji zwracających \texttt{Promise} możemy budować sekwencje
operacji w sposób czytelny i łatwy do zarządzania.
\item Choć często sekwencje wywołań \texttt{then} są tworzone statycznie jedna po drugiej,
to jak pokazuje funkcja \texttt{loop} można to robić w sposób dynamiczny, w celu np.
wymuszenia kolejności pomiędzy zadaniami.
\item Funkcja \texttt{waterfall} jest bardziej ograniczająca niż podejście przedstawione w funkcji
\texttt{loop}, bo musimy na starcie podać tablicę naszych zadań do wykonania.
\newpage
\end{itemize}
\section*{Zadanie 2}
\label{sec:orgdc55603}
Najpierw tworzymy funkcję która zlicza ilość linii w pliku, według podanego kodu w poleceniu:
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{const} \EFv{SPLIT\_REGEX} = \EFs{/\char92{}r\char92{}n|[\char92{}n\char92{}r\char92{}u0085\char92{}u2028\char92{}u2029]/}g;

\EFk{function} \EFf{countLinesInFile}(\EFv{path}) \{
  \EFk{let} \EFv{count} = \EFhn{0};
  \EFk{return} \EFk{new} \EFt{Promise}((resolve, reject) => \{
    fs.createReadStream(path)
      .on(\EFs{"data"}, \EFk{function} (\EFv{chunk}) \{
        count += chunk.toString(\EFs{"utf8"}).split(SPLIT\_REGEX).length - \EFhn{1};
      \})
      .on(\EFs{"end"}, \EFk{function} () \{
        console.log(path, count);
        resolve(count);
      \})
      .on(\EFs{"error"}, \EFk{function} (\EFv{err}) \{
        console.error(err);
        reject(err);
      \});
  \});
\}
\end{Verbatim}
\end{Code}

Funkcja \texttt{countLinesInFile} zwraca obietnicę, która jest spełniona gdy zakończymy
przetwarzanie pliku, a odrzucona gdy wystąpi błąd.
\subsection*{Podejście synchroniczne}
\label{sec:orgb47d467}
W tym podejściu tworzymy sekwencję operacji w podobnym sposób jak w funkcji
\texttt{loop}. Wartość \texttt{value} to obecna suma linii w plikach.

\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{const} \EFv{walker} = walkdir(\EFs{"./PAM08"});
\EFk{let} \EFv{promise} = \EFk{new} \EFt{Promise}((resolve, \_) => resolve(\EFhn{0}));
walker.on(\EFs{"file"}, (path, stat) => \{
  \EFk{if} (stat.isFile()) \{
    promise = promise.then(
      \EFk{async} (value) => value + (\EFk{await} countLinesInFile(path))
    );
  \}
\});

walker.on(\EFs{"end"}, () => \{
  promise
    .then((value) => \{
      console.log(\EFs{"Total lines:"}, value);
    \})
    .\EFk{catch}((err) => \{
      console.error(err);
    \});
\});
\end{Verbatim}
\end{Code}

\begin{Code}
\begin{Verbatim}
\color{EFD}C:\char92{}Users\char92{}piotr\char92{}Documents\char92{}tw-labjs\char92{}PAM08\char92{}WisconsinA\char92{}WisconsinA\_www.yahoo.co.jp.html \EFhn{25}
C:\char92{}Users\char92{}piotr\char92{}Documents\char92{}tw-labjs\char92{}PAM08\char92{}WisconsinA\char92{}WisconsinA\_www.yahoo.com.html \EFhn{18}
C:\char92{}Users\char92{}piotr\char92{}Documents\char92{}tw-labjs\char92{}PAM08\char92{}WisconsinA\char92{}WisconsinA\_www.youtube.com.html \EFhn{17}
Total lines: \EFhn{61823}
\end{Verbatim}
\end{Code}

Aby zmierzyć czas wykoania programu tworzymy funkcję \texttt{measure} i
\texttt{calculateAverageTime}, w celu pomiaru czasu wykonania została zakomentowana linia.

\begin{Code}
\begin{Verbatim}
\color{EFD}console.log(path, count);
\end{Verbatim}
\end{Code}

\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{function} \EFf{measure}() \{
  \EFk{return} \EFk{new} \EFt{Promise}((resolve, reject) => \{
    \EFk{const} \EFv{start} = performance.now();
    \EFk{let} \EFv{promise} = \EFk{new} \EFt{Promise}((resolve, \_) => resolve(\EFhn{0}));
    \EFk{const} \EFv{walker} = walkdir(\EFs{"./PAM08"});

    walker.on(\EFs{"file"}, (path, stat) => \{
      \EFk{if} (stat.isFile()) \{
        promise = promise.then(
          \EFk{async} (value) => value + (\EFk{await} countLinesInFile(path))
        );
      \}
    \});

    walker.on(\EFs{"end"}, () => \{
      promise
        .then((value) => \{
          console.log(\EFs{"Total lines:"}, value);
          \EFk{const} \EFv{end} = performance.now();
          resolve(end - start);
        \})
        .\EFk{catch}((err) => \{
          console.error(err);
          reject(err);
        \});
    \});
  \});
\}

\EFk{async} \EFk{function} calculateAverageTime() \{
  \EFk{const} \EFv{N} = \EFhn{10};
  \EFk{let} \EFv{sum} = \EFhn{0};
  \EFk{for} (\EFk{let} \EFv{i} = \EFhn{0}; i < N; i++) \{
    sum += \EFk{await} measure();
  \}
  console.log(\EFs{`Average time: \$\{sum / N\}ms`});
\}

calculateAverageTime();
\end{Verbatim}
\end{Code}

Wynik:
\begin{tcolorbox}
\begin{Verbatim}
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Average time: 369.36642ms
\end{Verbatim}

\end{tcolorbox}
\subsection*{Podejście asynchroniczne}
\label{sec:org571dc33}
Większość kodu jest identyczna z podejściem synchronicznym.
Kluczowe zmiany znajdują się w callbackach do \texttt{walker.on("file")}
i \texttt{walker.on("end")}. W tym podejściu tworzymy tablicę
obietnic/zadań, a następnie używając funkcji \texttt{Promise.all} czekamy, aż
wszystkie się zakończą. Wtedy dostajemy tablice wartości
zwróconych z naszych obietnic i je sumujemy.

\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{const} \EFv{tasks} = [];
\EFk{const} \EFv{walker} = walkdir(\EFs{"./PAM08"});
walker.on(\EFs{"file"}, (path, stat) => \{
  tasks.push(countLinesInFile(path));
\});

walker.on(\EFs{"end"}, () => \{
  Promise.all(tasks)
    .then((values) => \{
      console.log(
        \EFs{"Total lines:"},
        values.reduce((a, b) => a + b, \EFhn{0})
      );
    \})
    .\EFk{catch}((err) => \{
      console.error(err);
    \});
\});
\end{Verbatim}
\end{Code}

Wynik:
\begin{Code}
\begin{Verbatim}
\color{EFD}...
C:\char92{}Users\char92{}piotr\char92{}Documents\char92{}tw-labjs\char92{}PAM08\char92{}WashingtonDCC\char92{}WashingtonDCC\_www.wikipedia.org.html \EFhn{33}
C:\char92{}Users\char92{}piotr\char92{}Documents\char92{}tw-labjs\char92{}PAM08\char92{}WashingtonDCC\char92{}WashingtonDCC\_www.yahoo.com.html \EFhn{57}
C:\char92{}Users\char92{}piotr\char92{}Documents\char92{}tw-labjs\char92{}PAM08\char92{}WashingtonDCC\char92{}WashingtonDCC\_www.youtube.com.html \EFhn{37}
Total lines: \EFhn{61823}
\end{Verbatim}
\end{Code}

W identyczny sposób jak w podejściu synchroniczmym tworzymy funkcję \texttt{measure}. Funkcja
\texttt{calculateAverageTime} pozostaje bez zmian.

Wynik:
\begin{tcolorbox}
\begin{Verbatim}
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Total lines: 61823
Average time: 144.57031ms
\end{Verbatim}


\end{tcolorbox}
