cw09/cw9.org
** Wnioski
+ Widzimy, że w celu rozwiązania naszego problemu użyto jednocześnie:
  + mechanizmu obietnic
  + =async= / =await=
  + callbacki

  Wszystkie te mechanizmy dobrze ze sobą współpracują, co jest szczególnie ważne
  gdy dana biblioteka wspiera tylko jeden z nich. =walkdir= wspiera jedynie
  callbacki, ale i tak mogliśmy łatwo stworzyć funkcję, która z niej korzysta
  i jednocześnie zwraca obietnicę. Choć takie ''mieszanie'' da się zrobić, to jednak
  tracimy na czytelności kodu, więc lepiej robić to tylko w ramach ostateczności.
+ Wyniki obu podejść są identyczne.
+ Wersja asynchroniczna jest wedle oczekiwań dużo szybsza od synchronicznej(ponad dwukrotnie).
+ Programowanie asynchroniczne w języku JavaScript silnie różni się od
  programowania asynchroniczengo np. w Javie. W programowaniu asynchronicznym w
  JavaScript większy nacisk kładzie się na mechanizmy oparte na zdarzeniach oraz
  zarządzanie obietnicami. W Javie natomiast asynchroniczność często
  opiera się na wielowątkowości i zarządzaniu wątkami (np. przy użyciu
  =ExecutorService=).

* Bibliografia
+ [[https://www.npmjs.com/package/walkdir][Walkdir - npm package]]
+ [[https://nodejs.org/api/fs.html][Node.js File System (fs) API]]
+ [[https://caolan.github.io/async/v3/docs.html][Async.js Documentation]]
