cw09/cw9.tex
\subsection*{Wnioski}
\label{sec:org61f3d43}
\begin{itemize}
\item Widzimy, że w celu rozwiązania naszego problemu użyto jednocześnie:
\begin{itemize}
\item mechanizmu obietnic
\item \texttt{async} / \texttt{await}
\item callbacki
\end{itemize}

Wszystkie te mechanizmy dobrze ze sobą współpracują, co jest szczególnie ważne
gdy dana biblioteka wspiera tylko jeden z nich. \texttt{walkdir} wspiera jedynie
callbacki, ale i tak mogliśmy łatwo stworzyć funkcję, która z niej korzysta
i jednocześnie zwraca obietnicę. Choć takie ''mieszanie'' da się zrobić, to jednak
tracimy na czytelności kodu, więc lepiej robić to tylko w ramach ostateczności.
\item Wyniki obu podejść są identyczne.
\item Wersja asynchroniczna jest wedle oczekiwań dużo szybsza od synchronicznej(ponad dwukrotnie).
\item Programowanie asynchroniczne w języku JavaScript silnie różni się od
programowania asynchroniczengo np. w Javie. W programowaniu asynchronicznym w
JavaScript większy nacisk kładzie się na mechanizmy oparte na zdarzeniach oraz
zarządzanie obietnicami. W Javie natomiast asynchroniczność często
opiera się na wielowątkowości i zarządzaniu wątkami (np. przy użyciu
\texttt{ExecutorService}).
\end{itemize}
\section*{Bibliografia}
\label{sec:org8ef898c}
\begin{itemize}
\item \href{https://www.npmjs.com/package/walkdir}{Walkdir - npm package}
\item \href{https://nodejs.org/api/fs.html}{Node.js File System (fs) API}
\item \href{https://caolan.github.io/async/v3/docs.html}{Async.js Documentation}
\end{itemize}
\end{document}
